// Можна додати на початок масиву [3, 7, 9] значення [4, 3, 9] за допомогою методу unshift():

let arr = [3, 7, 9];
arr.unshift(4, 3, 9);
console.log(arr); // [4, 3, 9, 3, 7, 9]
// Можна також створити новий масив, що містить обидва масиви, за допомогою оператора spread:

let arr10 = [3, 7, 9];
let arr11 = [4, 3, 9];
let arr12 = [...arr11, ...arr10];
console.log(arr); // [4, 3, 9, 3, 7, 9]
// Щоб додати на кінець масиву значення [8, 7, 6], можна використати метод push():

let arr3 = [3, 7, 9];
arr3.push(8, 7, 6);
console.log(arr3); // [3, 7, 9, 8, 7, 6]
// Можна також скористатися оператором spread для створення нового масиву, що містить обидва масиви:
let arr4 = [3, 7, 9];
let arr5 = [8, 7, 6];
let arr6 = [...arr4, ...arr5];
console.log(arr6); // [3, 7, 9, 8, 7, 6]
// Або методом concat():

let arr7 = [3, 7, 9];
let arr8 = [8, 7, 6];
let arr9 = arr7.concat(arr8);
console.log(arr9); // [3, 7, 9, 8, 7, 6]