const homeButton = document.getElementById('home-button');
const homeModal = document.getElementById('Home');
const modalContent = document.getElementById('modal-content');
const darkOverlay = document.getElementById('dark');
const homeCloseButton = document.getElementById('button-x1');
const mapElement = document.getElementById('map');

homeCloseButton.addEventListener('click', () => {
  homeModal.style.display = 'none';
  darkOverlay.style.display = 'none';
});

homeButton.addEventListener('click', () => {
  homeModal.style.display = 'block';
  mapElement.style.display = 'none';
  homeModal.style.zIndex = 1;
  document.body.classList.add('modal-open');
  homeModal.innerHTML = `
  <h1>Веб-додаток, що надає прогноз погоди на сьогодні та на наступні 3 дні та 5 днів з використанням безкоштовного API.</h1>
  <p>Ідеї для проекту:</p>
  <ul>
    <li>+ Зроблено</li>
    <li>- В планах зробити</li>
    <li>+- Частково реалізовано</li>
  </ul>
  <ul>
  <li>
  <p>+1. Щоб реалізувати цей проект, використано безкоштовний API від OpenWeatherMap, який надає доступ до погодних даних у форматі JSON. 
  Після цього створити веб-додаток, який запитує дані з цього API та відображає їх на сторінці.</p>
  </li>
  <li>
  <p>+2. Для відображення даних на сторінці використано DOM дерево. Наприклад, створити список елементів,
  кожен з яких містить інформацію про погоду на один день. Для кожного елементу відображати дату, температуру, вологість, 
  швидкість вітру та іншу інформацію. Також відображати графік температур для кожного дня.</p>
  </li>
  <li>
  <p>+3. Крім того, додати функціональність вибору місця, для якого відображатиметься прогноз погоди. 
  Це зробити з використанням API для геолокації, або створити власну форму вводу місця для відображення прогнозу погоди.</p>
  </li>
  <li>
  <p>-4. Для більшого зручності користувачів також додати функціональність нотифікацій, які будуть повідомляти користувачів про зміни в погоді на наступний день.</p>
  </li>
  <li>
  <p>+5. Такий проект може бути корисним для багатьох користувачів, особливо для тих, які постійно стикаються зі змінами погоди та хочуть завжди бути в курсі її прогнозу.</p>
  </li>
  <li>
  <p>-6. До додатка з прогнозом погоди додати ряд додаткових функцій, які забезпечать кращий користувацький досвід та більше інформації. Кілька ідей:</p>
  </li>
  <li>
      <p>-7. Погодні умови на певний час: Додати можливість користувачам отримувати прогноз погоди на певний час у майбутньому. Користувачі можуть вибрати дату та час, а додаток покаже прогноз погоди на цей момент.</p>
    </li>
    <li>
      <p>+8. Додаткові погодні дані: Відображати більше даних про погоду, таких як тиск, видимість, стан неба, індекс УФ-випромінювання та ймовірність опадів.</p>
    </li>
    <li>
      <p>-9. Пошук міст з автозаповненням: Забезпечити користувачам можливість швидкого пошуку міст за допомогою автозаповнення. Це зробити за допомогою API, яке надає список міст на основі введеного користувачем тексту.</p>
    </li>
    <li>
      <p>-10. Погодні віджети: Створити віджети для різних платформ (Windows, macOS, Android, iOS), які відображатимуть прогноз погоди прямо на робочому столі або головному екрані користувачів.</p>
    </li>
    <li>
      <p>+11. Карта погоди: Додано інтерактивну карту, яка показує поточні погодні умови, температуру або інші погодні параметри для різних місць у світі. Користувачі можуть змінювати масштаб та переміщатися по карті, щоб перевірити погоду в інших регіонах.</p>
    </li>
  <li><p>-12. Сповіщення про погоду: Дозволити користувачам підписатися на сповіщення про погоду для їхнього регіону. 
Вони можуть отримувати попередження про негоду, шторми або інші екстремальні погодні умови.</p></li>
  <li><p>+13. Темна тема: Додати перемикач теми, що дозволить користувачам вибирати між світлою та темною темами для додатка. 
Темна тема може полегшити читання інформації в нічний час та забезпечити кращий користувацький досвід.</p></li>
  <li><p>+-14. Багатомовність: Розширите додаток, додавши підтримку кількох мов. Забезпечено введення різними мовами, в планах переклад інтерфейсу та погодних даних на різні мови, 
щоб користувачі з різних країн могли користуватися вашим додатком.</p></li>
  <li><p>+15. Зберігання останнього запиту: Зберігати останній запит користувача (місто або координати) у локальному сховищі (LocalStorage), 
щоб при наступному відкритті додатка автоматично відображалась погода для цього місця.</p></li>
<li>
<p>
    -Соціальний обмін: Додати кнопки для обміну прогнозом погоди у соціальних мережах, таких як Facebook, Twitter, Instagram тощо. 
    Це дозволить користувачам швидко та легко поділитися погодними умовами та прогнозами з друзями та сім'єю.
</p>
</li>
    <li>
<p>
    -Голосовий помічник: Інтегрувати в додаток із голосовими помічниками, такими як Google Assistant, Amazon Alexa або Apple Siri. 
    Користувачі зможуть запитувати погоду за допомогою голосових команд.
</p>
</li>
    <li>
<p>
    +Власні стилі для погодних значків: Створити власні значки погоди, які краще підходять до стилю додатка. 
    Власні значки можуть поліпшити загальний вигляд додатка та забезпечити унікальний користувацький досвід.
</p>
</li>
    </ul>
  `;
  // Додаємо кнопку закриття модального вікна
  const closeButton = document.createElement('button');
  closeButton.id = 'button-x1';
  closeButton.innerHTML = '<div id="x-icon"></div>';
  closeButton.addEventListener('click', () => {
    homeModal.style.display = 'none';
    darkOverlay.style.display = 'none';
    mapElement.style.display = 'block';
    homeModal.style.zIndex = 0;
    document.body.classList.remove('modal-open');
  });

  // Додаємо кнопку закриття до модального вікна
  homeModal.prepend(closeButton);

  // Показуємо модальне вікно та темний фон
  homeModal.style.display = 'block';
  //   darkOverlay.style.display = 'block';
});
